Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.vault_generic_secret.common_creds: Read complete after 0s [id=secret/common/user_profile/bryan]
data.cloudflare_zone.bryanwp: Read complete after 0s [id=d2287afe1d6fbddb1a27e1a5b85b0288]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.iso_image["1"] will be created
+ resource "proxmox_virtual_environment_file" "iso_image" {
      + content_type           = "iso"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "https://channels.nixos.org/nixos-23.05/latest-nixos-minimal-x86_64-linux.iso"
        }
    }

  # proxmox_virtual_environment_vm.kube_cp[0] will be created
+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "cp.polaris-0"
      + network_interface_names = (known after apply)
      + node_name               = "promox"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "cp",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 500

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1001
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # proxmox_virtual_environment_vm.kube_cp[1] will be created
+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "cp.polaris-1"
      + network_interface_names = (known after apply)
      + node_name               = "prox2"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "cp",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 501

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1001
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # proxmox_virtual_environment_vm.kube_cp[2] will be created
+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "cp.polaris-2"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "cp",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 502

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1001
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[0] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk.polaris-0"
      + network_interface_names = (known after apply)
      + node_name               = "promox"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 550

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1001
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 1
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDO4M863PiNN3BdJhQr/Gohwn9Hg3xIsUWvZ+ViM/w5LSDHOHOEkbFprRzLTpi0ZNYTkh1b3vY+tGm3gxuARUxedNrVEGEpn9xbrTXKwUA490rRC50I8UuYDzKd1rCF00m/HCUof8tgUiOkRXZV9I0LYuUItcTvpivXGr72j0qXRWc0coB/j06hpgf5Xi8sXuQ2xTcyu2xTifxuBDZB6sxeAcW43bQ99RajrPxlcjD+WZIyt/SZ6xY5tXEuvAzFpBhRaCXp9BA6KDghOWMjStZJICQkeLcXtMXeHZlicrpP/HTPHukh4hBckTHedqzVCCYzHZx6rY+5FlrI74AufVAH",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[1] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk.polaris-1"
      + network_interface_names = (known after apply)
      + node_name               = "prox2"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 551

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1001
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 1
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDO4M863PiNN3BdJhQr/Gohwn9Hg3xIsUWvZ+ViM/w5LSDHOHOEkbFprRzLTpi0ZNYTkh1b3vY+tGm3gxuARUxedNrVEGEpn9xbrTXKwUA490rRC50I8UuYDzKd1rCF00m/HCUof8tgUiOkRXZV9I0LYuUItcTvpivXGr72j0qXRWc0coB/j06hpgf5Xi8sXuQ2xTcyu2xTifxuBDZB6sxeAcW43bQ99RajrPxlcjD+WZIyt/SZ6xY5tXEuvAzFpBhRaCXp9BA6KDghOWMjStZJICQkeLcXtMXeHZlicrpP/HTPHukh4hBckTHedqzVCCYzHZx6rY+5FlrI74AufVAH",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[2] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk.polaris-2"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 552

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1001
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 1
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDO4M863PiNN3BdJhQr/Gohwn9Hg3xIsUWvZ+ViM/w5LSDHOHOEkbFprRzLTpi0ZNYTkh1b3vY+tGm3gxuARUxedNrVEGEpn9xbrTXKwUA490rRC50I8UuYDzKd1rCF00m/HCUof8tgUiOkRXZV9I0LYuUItcTvpivXGr72j0qXRWc0coB/j06hpgf5Xi8sXuQ2xTcyu2xTifxuBDZB6sxeAcW43bQ99RajrPxlcjD+WZIyt/SZ6xY5tXEuvAzFpBhRaCXp9BA6KDghOWMjStZJICQkeLcXtMXeHZlicrpP/HTPHukh4hBckTHedqzVCCYzHZx6rY+5FlrI74AufVAH",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://c4f00d43b117:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 7 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`